// Завдання 2

// Створіть сценарій.Запросіть у користувача вік.Якщо вік користувача більш як 18, 
// виведіть на екран повідомлення« Доступ дозволено».Якщо введене користувачем значення менш як 18, 
// виведіть на екран повідомлення« Доступ заборонено».

// let access = confirm("Для переходу далі слід підтвердити, що Вам виповнилося 18 років");

let userAge = +prompt("Для переходу далі вкажіть ваш вік");

let access = 18 <= userAge;

if(access){
    alert("Доступ дозволено");
} else {
    alert("Доступ заборонено");
}